console.log("Homework-12");

/* 1. აიღეთ ნებისმიერი ორი რიცხვი, შეკრიბეთ და შემდეგ შეამოწმეთ, თუ ჯამი არის ლუწი მაშინ დალოგეთ "ლუწი" თუ კენტი მაშინ "კენტი". გაითვალისწინეთ, რომ რიცხვები შეიძლება იყოს უარყოფითი . */

var x = -3;
var y = 2;
var z = x + y;

if (z % 2 === 0 && z > 0) {
  console.log("number is even");
} else if (z % 2 === 0 && z < 0) {
  z = z - 2 * z;
  console.log("number is even");
} else if (z === 0) {
  console.log(0);
}
else {
  console.log("number is odd");
};






/* 2. მოცემული გაქვთ სამკუთხედის ერთი გვერდი b და სიმაღლე h გამოთვალეთ სამკუთხედის ფართობი(ფორმულას არ დავაზუსტებ) b და h შეიძლება იყოს ნებისმიერი რიცხვი, აქვე გაითვალისწინეთ რომ თუ რომელიმე რიცხვი არის უარყოფითი გთხოვთ შეაბრუნოთ და გახადოთ დადებითი .*/