
/*1. შექმენით ფუნქცია რომელიც მიიღებს title პარამეტრს მაგ: title = "Smartacademy" -ს. ციკში დაუარეთ title სტრინგის თვითოეულ ითემს და შემოაბრუნეთ ეს სტრინგი ანუ თუ title პარამეტრი = "Smartacademy" -ს მაშინ ფუნქციამ შედეგად უნდა დააბრუნოს "ymedacatramS"*/ 


var title = "Smartacademy";

for (var i = title.length; i >= 0; i--) {
  console.log(title[i]);
}

/* 2.მოცემული გაქვთ სტრინგული ტიპის ცვლადი numbers = "123456789" ცვლადიდან აიღეთ თვითოეული ითემი და 
აახარისხეთ თავის თავზე ანუ მაგალითად:
1 ** 1 = 1
2 ** 2 = 4
3 ** 3 = 9*/

var number = [1, 2, 3, 4, 5, 6, 7, 8];

for (var i = 0; i < number.length; i++) {
  console.log(number[i] ** number[i]);
}


/*3.აქაც მოცემული გაქვთ სტრინგული ტიპის ცვლადი numbers = "123456789" ცვლადიდან აიღეთ 
თითოეული აითემი დაა ახარისხეთ ყველა შესაძლო ვარიანტზე ანუ მაგალითად
1 ** 1 = 1
1 ** 2 = 1
1 ** 3 = 1
..............
2 ** 1 = 2
2 ** 2 = 4
2 ** 3 = 8
...............
3 ** 1 = 3
3 ** 2 = 9
3 ** 3 = 27
...............*/


var numbers = [1, 2, 3, 4, 5, 6, 7, 8];
var j;

for (var j = 0; j < numbers.length; j++) {
  for (var i = 0; i < numbers.length; i++) {

    console.log(numbers[j] ** numbers[i])

  }
}
